fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
    <comment>Диплом. Задача: &quot;Работа с заявками клиентов&quot;</comment>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
Функция ПолучитьДокументыРеализации(ДатаНачала, ДатаОкончания) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия КАК ВКМ_ДатаНачалаДействия,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия КАК ВКМ_ДатаОкончанияДействия,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Организация = РеализацияТоваровУслуг.Организация
		|			И ДоговорыКонтрагентов.Владелец = РеализацияТоваровУслуг.Контрагент
		|			И ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|			И (РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ))
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия <= &ДатаНачала
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия >= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УИДРеализаций = Новый Массив;	
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			
			ДоговорУИД = Строка(ВыборкаДетальныеЗаписи.Договор.УникальныйИдентификатор());
			РеализацияУИД = Строка(ВыборкаДетальныеЗаписи.Реализация.УникальныйИдентификатор());
			
			ДанныеДляТЧСписокДоговоров = Новый Структура;
			ДанныеДляТЧСписокДоговоров.Вставить("Договор", ДоговорУИД);
			ДанныеДляТЧСписокДоговоров.Вставить("Реализация", РеализацияУИД);
				
			УИДРеализаций.Добавить(ДанныеДляТЧСписокДоговоров);
			
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = ДатаОкончания; 
			НовыйДок.Организация = ВыборкаДетальныеЗаписи.Организация;
			НовыйДок.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;			
			НовыйДок.Договор = ВыборкаДетальныеЗаписи.Договор;
			НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
			НовыйДок.Комментарий = "Документ создан при помощи механизма ""Массовое создание актов""";
			
			Попытка	
				
				НовыйДок.Записать();
				
				Если Не НовыйДок.ПроверитьЗаполнение() Тогда
					Продолжить;
				КонецЕсли; 
				
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
				
				НовыйДокСсылка = НовыйДок.Ссылка;
	
				ДоговорУИД = Строка(ВыборкаДетальныеЗаписи.Договор.УникальныйИдентификатор());
				РеализацияУИД = Строка(НовыйДокСсылка.УникальныйИдентификатор());
				
				ДанныеДляТЧСписокДоговоров = Новый Структура;
				ДанныеДляТЧСписокДоговоров.Вставить("Договор", ДоговорУИД);
				ДанныеДляТЧСписокДоговоров.Вставить("Реализация", РеализацияУИД);
				
				УИДРеализаций.Добавить(ДанныеДляТЧСписокДоговоров);
				
			Исключение
				ВызватьИсключение;
			КонецПопытки; 
			
		КонецЕсли; 
		
		
	КонецЦикла;
	
	
	Возврат ЗаписатьЗначениеJSON(УИДРеализаций);
	
КонецФункции
